# SetFilterVisibility Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
View..::..SetFilterVisibility Method
View Class See Also
---
Sets the visibility of the elements associated with a filter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void SetFilterVisibility(
	ElementId filterElementId,
	bool visibility
)
```

Visual Basic
---
```text
Public Sub SetFilterVisibility ( _
	filterElementId As ElementId, _
	visibility As Boolean _
)
```

Visual C++
---
```text
public:
void SetFilterVisibility(
	ElementId^ filterElementId,
	bool visibility
)
```

# ### Parameters
filterElementId
    Type: Autodesk.Revit.DB..::..ElementId The ElementId of the filter.
visibility
    Type: System..::..Boolean True if the elements associated with the filter are visible in the view, false otherwise.
# Remarks
If the filter is not currently applied to the view, this will add the filter with the specified visibility.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | ElementId is not associated with a FilterElement. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | View does not belong to a project document. -or- The view type does not support Visibility/Graphics Overriddes. |

# See Also
View Class
Autodesk.Revit.DB Namespace